benchmark/report/rps/overload/20260804_164246/raw/016_upload_1mb_c5_r1.txt
Running 5s test @ http://127.0.0.1:32781/api/files/upload
  5 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.02ms   57.78ms 344.20ms   80.33%
    Req/Sec     2.10      0.68     3.00     54.10%
  Latency Distribution
     50%  120.11ms
     75%  143.81ms
     90%  216.91ms
     99%  344.20ms
  61 requests in 5.10s, 37.59KB read
Requests/sec:     11.96
Transfer/sec:      7.37KB
HPS_WRK_REQUESTS 61
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 61
HPS_STATUS_2XX 61
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 201=61