benchmark/report/rps/overload/20260804_164246/raw/021_download_1mb_c500_r1.txt
Running 20s test @ http://127.0.0.1:32781/api/files/by-hash/a669342693d7d57e2384517b6990e2f0d10933101fb23f7d6b467b3e94c56776/download
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59s     1.40s    4.99s    57.25%
    Req/Sec    33.61     25.17   130.00     64.71%
  Latency Distribution
     50%    2.59s 
     75%    3.82s 
     90%    4.54s 
     99%    4.94s 
  1541 requests in 20.07s, 1.51GB read
  Socket errors: connect 0, read 0, write 0, timeout 1155
Requests/sec:     76.79
Transfer/sec:     76.83MB
HPS_WRK_REQUESTS 1541
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 1155
HPS_STATUS_TOTAL 1541
HPS_STATUS_2XX 1541
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=1541